VPro/src/Documents/JobSheet/JobSheet.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>JobSheet</name>
  <basedOn>Document.ProductionOrder</basedOn>
  <basedOn>Document.CustomerOrder</basedOn>
  <registerRecords>AccumulationRegister.JobSheets</registerRecords>
  <registerRecords>AccountingRegister.Managerial</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>AccumulationRegister.ProductionStages</registerRecords>
  <registerRecords>AccumulationRegister.AccrualsAndDeductions</registerRecords>
  <registerRecords>AccumulationRegister.PayrollPayments</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.CustomerOrder</types>
      <types>DocumentRef.ProductionOrder</types>
      <types>DocumentRef.InventoryAssembly</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ClosingDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Teams</types>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>PerformerPosition</name>
    <type>
      <types>EnumRef.AttributePositionOnForm</types>
    </type>
  </attributes>
  <attributes>
    <name>PerfomerDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionOrder</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionOrderPosition</name>
    <type>
      <types>EnumRef.AttributePositionOnForm</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnitPosition</name>
    <type>
      <types>EnumRef.AttributePositionOnForm</types>
    </type>
  </attributes>
  <attributes>
    <name>StructurlUnitDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Operations</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomerOrder</name>
      <type>
        <types>DocumentRef.CustomerOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>ProductsAndServices</name>
      <type>
        <types>CatalogRef.ProductsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsAndServicesCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Operation</name>
      <type>
        <types>CatalogRef.ProductsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QuantityFact</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeNorm</name>
      <comment>Standard time for operation completion in minutes</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Tariff</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>StandardHours</name>
      <comment>Operation duration in minutes</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Cost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsAndServicesBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Specification</name>
      <type>
        <types>CatalogRef.Specifications</types>
      </type>
    </attributes>
    <attributes>
      <name>StructuralUnit</name>
      <type>
        <types>CatalogRef.StructuralUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>Performer</name>
      <type>
        <types>CatalogRef.Teams</types>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ProductionOrder</name>
      <type>
        <types>DocumentRef.ProductionOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Stage</name>
      <type>
        <types>CatalogRef.ProductionStages</types>
      </type>
    </attributes>
    <attributes>
      <name>CompletiveStageDepartment</name>
      <type>
        <types>CatalogRef.StructuralUnits</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TeamMembers</name>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>LPF</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>StructuralUnit</name>
      <type>
        <types>CatalogRef.StructuralUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/InformationRegisters/Employees/Employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Employees</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </resources>
  <resources>
    <name>Position</name>
    <type>
      <types>CatalogRef.Positions</types>
    </type>
  </resources>
  <resources>
    <name>OccupiedRates</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>WorkSchedule</name>
    <type>
      <types>CatalogRef.WorkSchedules</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/Enums/AttributePositionOnForm/AttributePositionOnForm.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AttributePositionOnForm</name>
  <enumValues>
    <name>InHeader</name>
  </enumValues>
  <enumValues>
    <name>InTabularSection</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Catalogs/Employees/Employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Employees</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ind</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>OccupationType</name>
    <type>
      <types>EnumRef.OccupationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsHumanResourcesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvanceHoldersGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>OverrunGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>NotValid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Documents/JobSheet/Forms/FormChangeBrigadeContent/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Not Parameters.Property("ID", ID)
		Or Not Parameters.Property("ConnectionKey", ConnectionKey)
		Or Not Parameters.Property("StructuralUnitPosition", StructuralUnitPosition)
		Or Not Parameters.Property("Brigade", Brigade) Then
		Cancel = True;
		Return;
	EndIf;
	
	Parameters.Property("Company", Company);
	Parameters.Property("StructuralUnit", StructuralUnit);
	Parameters.Property("Date", Date);
	
	BrigadeContent.Clear();
	If Parameters.Property("BrigadeContent") Then
		For Each ContentDescription In Parameters.BrigadeContent Do
			FillPropertyValues(BrigadeContent.Add(), ContentDescription);
		EndDo; 
	EndIf;
	
	If StructuralUnitPosition= Enums.AttributePositionOnForm.InHeader Then
		CommonUseClientServer.SetFormItemProperty(Items, "BrigadeContentStructuralUnit", "Visible", False);
	EndIf;
	
	If Parameters.Property("HideTabelNumber") And Parameters.HideTabelNumber=True Then
		CommonUseClientServer.SetFormItemProperty(Items, "BrigadeContentEmployeeTN", "Visible", False);
	EndIf; 
	
EndProcedure

#EndRegion

#Region FormItemsEventsHandlers

&AtClient
Procedure BrigadeContentOnStartEdit(Item, NewRow, Clone)
	
	If NewRow Then
		Items.BrigadeContent.CurrentData.LPR = 1;
	EndIf; 	
	
EndProcedure

&AtClient
Procedure BrigadeContentOnChange(Item)
	
	CurrentRow = Items.BrigadeContent.CurrentData;
	If Items.BrigadeContent.Visible Then
		CurrentRow.StructuralUnit = EmployeeDepartment(Company, CurrentRow.Employee, Date);
	EndIf;
	
EndProcedure

#EndRegion

#Region CommandFormHandlers

&AtClient
Procedure FillBrigadeContent(Command)
	
	FillBrigadeOnServer();
	
EndProcedure

&AtClient
Procedure WriteAndClose(Command)
	
	ClosingParameters = New Structure;
	ClosingParameters.Insert("Event", "ChangingBrigadeContent");
	ClosingParameters.Insert("ConnectionKey", ConnectionKey);
	ClosingParameters.Insert("ID", ID);
	ClosingParameters.Insert("BrigadeContent", New Array);
	
	For Each TabSecRow In BrigadeContent Do
		RowDescription = New Structure("Employee, LPR, StructuralUnit");
		FillPropertyValues(RowDescription, TabSecRow);
		ClosingParameters.BrigadeContent.Add(RowDescription);
	EndDo;
	
	NotifyChoice(ClosingParameters);
	
EndProcedure

#EndRegion

#Region ServiceMethod

&AtServer
Procedure FillBrigadeOnServer() Export

	BrigadeContent.Clear();
	ContentTable = Catalogs.Teams.BrigadeContent(Brigade, Company, Date);
	
	For Each TabSecRow In ContentTable Do
		NewRow = BrigadeContent.Add();
		FillPropertyValues(NewRow, TabSecRow);
		NewRow.LPR = 1;
		If StructuralUnitPosition = Enums.AttributePositionOnForm.InHeader Then
			NewRow.StructuralUnit = StructuralUnit;
		EndIf;
	EndDo 

EndProcedure

&AtServerNoContext
Function EmployeeDepartment(Company, Employee, Date)
	
	Query = New Query;
	Query.SetParameter("Company", Company);
	Query.SetParameter("Employee", Employee);
	Query.SetParameter("SlicePeriod", ?(ValueIsFilled(Date), Date, EndOfDay(CurrentSessionDate())));
	Query.Text =
	"SELECT
	|	Staff.Ref AS Employee,
	|	ISNULL(StaffSliceLast.StructuralUnit, VALUE(Catalog.StructuralUnits.EmptyRef)) AS StructuralUnit
	|FROM
	|	Catalog.Employees AS Staff
	|		LEFT JOIN InformationRegister.Employees.SliceLast(&SlicePeriod, Company = &Company) AS StaffSliceLast
	|		ON (StaffSliceLast.Employee = Staff.Ref)
	|WHERE
	|	Staff.Ref = &Employee";
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.StructuralUnit;
	Else
		Return Catalogs.StructuralUnits.EmptyRef();
	EndIf; 
	
EndFunction

#EndRegion
